
import pandas as pd
import numpy as np


doctor_sex_dict = {
    '男':1,
    '女':0
}

doctor_title_dict = {
    "无": 0,
    "初级": 1,
    "住院医师": 2,
    "副主任医师": 3,
    "副主任": 3,
    "副主任医生":3,
    "主治医师": 5,
    "主治": 5,
    "主治医生": 5,
    "主任医师": 6,
}
doctor_unit_dict = {
    # 二甲医院
    "二甲医院": 1,
    # 三甲医院
    "三甲医院": 2,
    # 医学院
    "医学院": 3,
}

#下面这个映射普适模型auc77
doctor_field_dict = {
#急诊
    "急诊": 1,
    "急救医学": 2,
    "急诊医学": 1,
    "急诊内科": 3,
    "内科急症": 3,
    "急诊专业": 1,
    "急诊科": 1,
#内科
	"内科": 4,
    "肾内": 5,
    "心内科": 6,
    "呼吸内科": 7,
    "呼吸系疾病": 8,
    "脓毒性休克": 9,
    "脓毒症": 10,
    "神经内科": 11,
	"呼吸系统疾病，感染性疾病，心血管疾病，急危重症": 12,
    "冠脉介入": 13,
    "呼吸": 8,
    "呼吸衰竭": 14,
    "肝病及感染性疾病": 15,
    "脾胃病": 16,
    "脓毒症、重症肺炎等": 10,
    "内科常见病及急危重症的处理": 4,
    "心胸": 17,
    "大内科": 4,
    "普通内科": 4,
    "肿瘤内科": 18,
    "内分泌科": 19,
    "风湿免疫": 20,
    "消化内科": 21,
#外科
    "神经外科": 22,
    "重大外科术后管理": 24,
    "普外": 25,
    "肛肠": 26,
    "血管外科": 27,
#骨科
    "骨科": 23,
#重症医学
    "神经重症": 28,
    "急危重病人救治": 29,
    "危急重症急救": 29,
    "重症": 30,
	"重症医学": 30,
    "重症专业": 30,
    "重症感染、呼吸危重症": 31,
    "重症科": 30,
    "危急重症患者抢救": 29,
    "急危重症抢救": 29,
    "重症医学科": 30,
    "急危重症": 29,
    "急诊医学（内科方向）": 31,
    "急症救治，常见病、慢性病诊治": 32,
    "重症感染": 33,
    "急救": 29,
    "急危重": 29,
    "心血管急重症": 34,
#妇产科
    "妇科": 35,
	"妇产科": 35,
    "妇产科诊治": 35,
#儿科
    "儿科": 36,
    "儿科临床医学": 36,
    "儿保": 36,
#皮肤科
    "皮肤科": 37,
#眼科
    "眼科": 38,
#中医
    "中医": 39,
    "中医针灸": 40,
#其他
    "临床医学": 41,
    "无": 42,
}

# 映射的数字尽量和专业领域的数字保持一致
doctor_depart_dict = {
    '急诊':1,
    '急诊科':1,
    '急诊内科': 1,
    '急诊医学科':1,
    'ICU':30,
    'icu': 30,

    '重症医学二病区':30,
    '重症医学科二病区':30,
    '重症医学科一病区':30,
    '重症医学科':30,
    '重症科':30,
    '重症医学':30,
    '呼吸与危重症医学科':30,
    '内科':4,
    '肾内科':4,
    '心内科':4,
    '呼吸内科':4,
    '神经内科':4,
    '心血管内科':4,
    '综合内科':4,
    '内分泌科':4,
    '呼吸':4,

    '神经综合科':2,

    '神经外科':22,
    '普外科':22,
    '心胸血管外科':22,
    '胸心血管外科（监护室）':22,

    '骨科':23,

    '儿科':36,

    '眼科':38,

    '妇科':35,
    '妇产科':35,

    '感染性疾病科':33,
    '脾胃科':16,
    '风湿免疫':20,
    '中医科':39,
    '中医肛肠科':39,
    '中医康复科':39,
    "麻醉科": 43
}



#10维度
#TODO 现在的诊断顺序是1-60，因为每个医生诊断了60个患者，如果在使用模型时 诊断顺序超过60的情况下，做映射 x/60 取整
def doctor_embeddimg(row):
    diag_seq = row['diag_seq']
    if str(row['doctor_unit']) != 'nan':
        doctor_unit = row['doctor_unit']
        doctor_sex = doctor_sex_dict.get(row['doctor_sex'])
        doctor_age = row['doctor_age']
        doctor_year = row['doctor_year']
        doctor_title = doctor_title_dict.get(row['doctor_title'])
        doctor_field = doctor_field_dict.get(row['doctor_field'])
        doctor_depart = doctor_depart_dict.get(row['doctor_depart'])
        embedding = [diag_seq,doctor_unit,doctor_sex,doctor_age,doctor_year,doctor_title,doctor_field,doctor_depart]
    else:
        embedding = [0,0,0,0,0,0,0,0]
    return np.array(embedding)
